[
    {
        "id": 73420,
        "title": "Apple Or Peach Strudel",
        "image": "https://spoonacular.com/recipeImages/73420-312x231.jpg",
        "ingredients": ["baking powder", "apples", "cinnamon", "milk", "eggs", "butter"], 
        "est_time": 18,
        "instructions": [
            "Oops! There are no instructions for this recipe, please check the other recipes in the search results, or adjust the search parameters"
        ]
    },
    {
        "id": 632660,
        "title": "Apricot Glazed Apple Tart",
        "image": "https://spoonacular.com/recipeImages/632660-312x231.jpg",
        "ingredients": ["apricot preserves", "apples", "cinnamon", "milk", "eggs", "butter"], 
        "est_time": 45,
        "instructions": [
            "In a food processor, pulse 1 1/2 cups of the flour with the salt.",
            "Add the cold butter and process just until the butter is the size of peas, about 5 seconds.",
            "Sprinkle the ice water over the mixture and process just until moistened, about 5 seconds.",
            "Transfer the dough to a lightly floured work surface and knead 2 or 3 times, just until it comes together. Pat the dough into a disk. On a lightly floured work surface, roll out the dough into a 16- to 17-inch round about 1/4 inch thick.",
            "Line a large baking sheet with parchment paper.",
            "Roll the dough around the rolling pin and unroll it onto the prepared baking sheet.",
            "In a small bowl, combine 2 tablespoons of the sugar with the remaining 1 tablespoon of flour and sprinkle over the dough. Arrange the apple slices on top in overlapping concentric circles to within 3 inches of the edge. Fold the dough over the apples in a free-form fashion.",
            "Brush the apples with the melted butter and sprinkle with the remaining 1 1/2 tablespoons of sugar and cinnamon. Refrigerate the unbaked tart until slightly chilled, about 10 minutes.",
            "Bake the tart in the center of the oven for 1 hour, or until the apples are tender and golden and the crust is deep golden and cooked through.",
            "Brush the apples with the melted preserves. Slide the parchment onto a wire rack and let the tart cool slightly before serving."
        ]
    },
    {
        "id": 640352,
        "title": "Cranberry Apple Crisp",
        "image":"https://spoonacular.com/recipeImages/640352-312x231.jpg",
        "ingredients": ["cranberries", "apples", "regular oats", "milk", "eggs", "butter"], 
        "est_time": 45,
        "instructions": [
            "Preheat the oven to 350 degrees and grease or butter a 913 glass baking dish.",
            "In a large bowl, toss together the chopped apples, cranberries and sugar. Let stand for a few minutes then pour into the baking dish.",
            "Dot the mixture with the 1/2 stick of cubed butter.",
            "In a medium bowl, combine the oats, brown sugar and flour.  Sprinkle evenly over the cranberries and apples in the baking dish.  Gently pour the melted butter over the top.",
            "Cover with aluminum foil and bake for 35 minutes.  Remove the foil and bake for an additional 15 minutes, or until the oat topping is nicely browned.",
            "Serve warm as a side or for dessert with a scoop of vanilla ice cream."
        ]
    },
    {
        "id": 641803,
        "title": "Easy & Delish! ~ Apple Crumble",
        "image": "https://spoonacular.com/…mages/641803-312x231.jpg",
        "ingredients": ["apples", "lemon zest", "ground cloves", "milk", "eggs", "butter"], 
        "est_time": 45,
        "instructions": [
            "Preheat Oven 350 degrees.",
            "Combine sliced apples, lemon zest, dash of ground cloves and sugar in a bowl and toss. Place in a deep dish buttered baking dish.",
            "In a smaller bowl combine the flour, sugar, brown sugar and butter. Mix this together with your fingers until it becomes crumbly. Place this mixture on top of the apples.",
            "Bake about 40-45 minutes, until the topping gets a little golden color."
        ]
    }
]